TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ТипыВнешнихПробWarehouse/гкс_ТипыВнешнихПробWarehouse.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>гкс_ТипыВнешнихПробWarehouse</name>
  <predefined>
    <items>
      <name>ПробаПервогоДня</name>
      <description>1-й день</description>
    </items>
    <items>
      <name>Лаборант</name>
      <description>Лаборант</description>
    </items>
    <items>
      <name>ЛотНаТысячуТон</name>
      <description>Лот на 1000т </description>
    </items>
    <items>
      <name>Элеватор</name>
      <description>Элеватор</description>
    </items>
  </predefined>
  <attributes>
    <name>ИдентификаторWarehouse</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеEN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоКомпозит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

TransportManagementDevelop_KAT/Конфигурация/src/Catalogs/гкс_ТипыВнешнихПробWarehouse/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет данные справочника из Warehouse
//
Процедура ОбновитьДанныеССервера() Экспорт
	
	РесурсВебСервиса = Справочники.гкс_РесурсыВебСервисов.ExternalSampleType;
	
	ПараметрыПреобразованияJSON = Новый Структура;
	ПараметрыПреобразованияJSON.Вставить("ПрочитатьВСоответствие", Ложь);
	ПараметрыПреобразованияJSON.Вставить("ИменаСвойствСоЗначениямиДата", "updatedOn");
	
	ДанныеОтветаВСтруктуре = гкс_ИнтеграцияWarehouse.ВыполнитьЗапросКWarehouse(
		РесурсВебСервиса, Неопределено, ПараметрыПреобразованияJSON);
		
	Ссылка = Справочники.гкс_ТипыВнешнихПробWarehouse.ПустаяСсылка();	
		
	гкс_ОбменДаннымиWarehouse.ОбработатьПолученныеДанные(ДанныеОтветаВСтруктуре, Ссылка);
			
КонецПроцедуры

#Область КонвертацияПриОбмене

// Возвращает имя ключевого реквизита объекта.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойства() Экспорт
	
	Возврат "ИдентификаторWarehouse";
	
КонецФункции

// Возвращает имя ключевого поля в Warehouse.
//
// Возвращаемое значение:
//   Строка
//
Функция ИмяКлючевогоСвойстваВWarehouse() Экспорт
	
	Возврат "id";
	
КонецФункции

// Устанавливает соотвествие имен реквизитов объекта 1с и полей ответа от Warehouse 
//
// Возвращаемое значение:
//  ТаблицаЗначений - таблица описания конвертации реквизитов:
// 		* СвойствоКонфигурации - Строка
// 		* СвойствоИсточника - Строка
// 		* ИспользуетсяАлгоритмКонвертации - Число 
// 		* ПравилоКонвертацииСвойства - Строка
// 		* ЭтоТабличнаяЧасть - Булево
//
Функция ИнициализацияПравилКонвертацийСвойств() Экспорт
	
	ПравилаКонвертации = гкс_ОбменДаннымиWarehouse.ИнициализацияПравилКонвертацийСвойств();

	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, ИмяКлючевогоСвойства(),	"id");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Наименование",		"name");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "НаименованиеEN",		"name_en");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "Описание",			"description");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ЭтоКомпозит",		"isComposite");
	гкс_ОбменДаннымиWarehouse.ДобавитьПКС(ПравилаКонвертации, "ПометкаУдаления", 	"isDeleted");
	
	Возврат ПравилаКонвертации;
		
КонецФункции

#КонецОбласти

#КонецОбласти	
	
#КонецЕсли
